Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: Go, take your place in the Temple and give the people all the teaching about this Life.
chr: ᎢᏤᎾ, ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᏫᏣᎴᎲᎦ ᎠᎴ ᏫᏗᏥᏬᏁᏓ ᏴᏫ ᏫᏗᏥᏃᎲᏏ ᏂᎦᏛ ᎧᏃᎮᏛ ᎯᎠ ᎾᏍᎩ ᎬᏂᏛ ᎤᎬᏩᎵ.

source: And hearing this, they went into the Temple at dawn, and were teaching. But the high priest and those who were with him got together the Sanhedrin and the representatives of the children of Israel, and sent to the prison to get them.
chr: ᎾᏍᎩᏃ ᎤᎾᏛᎦᏅ ᎩᎳ ᏧᎩᏥᏍᎪᎢ ᏭᏂᏴᎴ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᎴ ᏚᎾᏕᏲᏁᎢ. ᎠᏎᏃ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎤᎷᏨ, ᎠᎴ ᎾᏍᎩ ᎬᏩᎵᎪᏁᎯ, ᏚᏂᏟᏌᏁ ᏗᏂᎳᏫᎩ, ᎠᎴ ᏂᎦᏛ ᏄᏂᎬᏫᏳᏌᏕᎩ ᎢᏏᎵ ᏧᏪᏥ ᏧᎾᏤᎵᎦ, ᎠᎴ ᏫᏓᏯᏅᎲ ᎤᎾᏓᏅᏎ ᏗᏓᏍᏚᏗᏱ.

source: But the men who were sent saw that they were not in the prison, and came back with the news,
chr: ᎠᏎᏃ ᏗᎾᏓᏂᏱᏍᎩ ᏭᏂᎷᏨ ᏫᏚᎾᏠᏤ ᏗᏓᏍᏚᏗᏱ, ᏗᎤᎾᏨᏒᏃ ᎤᏂᏃᏁᎢ,

source: Saying, The doors of the prison were safely shut, and the keepers were at the doors, but when they were open, there was nobody inside.
chr: ᎯᎠ ᏄᏂᏪᏎᎢ; ᏗᏓᏍᏚᏗᏱ ᎤᏙᎯᏳᎯ ᎣᎩᏩᏛᎲ ᎤᎵᏂᎩᏗᏳ ᎠᏍᏚᎲᎩ, ᎠᎴ ᎠᏂᎦᏘᏯ ᎠᏂᏙᎾᎥ ᏙᏱᏗᏢ ᎦᎶᎯᏍᏗᏳᎶᏗ, ᎠᏎᏃ ᎣᎩᏍᏚᎢᏒ ᎥᏝ ᎩᎶ ᏲᏥᏩᏛᎮ ᏱᏯᎡᎢ.

source: Now, at these words, the captain of the Temple and the chief priests were greatly troubled about what might be the end of this business.
chr: ᎿᏉᏃ ᎠᏥᎸ-ᎨᎶᎯ ᎠᎴ ᎣᏍᏛ ᎢᏳᏩᎿᏕᎩ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ, ᎾᏍᎩ ᎯᎠ ᏄᏂᏪᏒ ᎤᎾᏛᎦᏅ, ᎾᏍᎩ ᎤᎾᏓᏅᏖᏔᏁᎢ, ᎭᏢ ᏮᏛᏍᏗᏥ ᎯᎠ, ᎤᏁᎵᏎᎢ.

source: And someone came and said to them, The men, whom you put in prison, are in the Temple teaching the people.
chr: ᎿᏉᏃ ᎩᎶ ᎤᎷᏤ ᎤᏂᏃᏁᎴ ᎯᎠ ᏄᏪᏎᎢ; ᎬᏂᏳᏉ ᎾᏍᎩ ᎠᏂᏍᎦᏯ ᏗᏓᏍᏚᏗᏱ ᏥᏕᏥᏴᏔᏅᎩ ᎠᏂᏯᎠ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᏂᏙᎾᎠ, ᎠᎴ ᏓᏁᏲᎲᏍᎦ ᏴᏫ.

source: Then the captain and some of the police went and took them, but not violently, for fear that they might be stoned by the people.
chr: ᎿᏉᏃ ᎣᏍᏛ ᎢᏳᏩᎿᏕᎩ ᎠᎴ ᏗᎾᏓᏂᏱᏍᎩ ᎬᏍᎦᎢᏍᏓᎩ ᏂᏚᏅᏁᎸᎾ ᏫᏚᏂᏯᏅᎮᎢ; ᏓᏂᏍᎦᎢᎮᏰᏃ ᎤᏂᏣᏘ, ᏅᏯ ᏱᏕᎪᎬᏂᏍᏓ ᎠᏁᎵᏍᎨᎢ.

source: And they took them into the Sanhedrin, and the high priest said to them,
chr: ᏚᎾᏘᏃᎸᏃ ᏕᎦᎳᏫᎥ ᎢᎬᏱᏗᏢ ᏑᏂᎧᏁᎢ. ᏄᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎨᎶᎯ ᏚᏛᏛᏁᎢ,

source: We gave you very clear orders not to give teaching in this name: and now Jerusalem is full of your teaching, and you are attempting to make us responsible for this man's death.
chr: ᎯᎠ ᏄᏪᏎᎢ; ᏝᏍᎪ ᎤᎵᏂᎩᏛᏯ ᏱᏨᏅᏍᏓᏕᎴ ᏗᏣᏕᏲᏗᏱ ᎯᎠ ᎾᏍᎩ ᏕᎤᏙᎥ ᎢᏨᏙᏗᏱ? ᎬᏂᏳᏉᏃ ᏕᏣᏕᏲᎲᏍᎬ ᏥᎷᏏᎵᎻ ᎢᏥᎧᎵᎢᏍᏔᏅ, ᎠᎴ ᎾᏍᎩ ᎠᏍᎦᏯ ᎤᎩᎬ ᎣᎩᏍᏛᏗᏍᏗᏱ, ᎢᏥᏰᎸᎭ.

source: But Peter and the Apostles, answering, said, We have to do the orders of God, not of man.
chr: ᏈᏓᏃ ᎠᎴ ᎨᏥᏅᏏᏛ ᎤᏂᏁᏨ ᎯᎠ ᏄᏂᏪᏎᎢ; ᎤᏁᎳᏅᎯ ᎣᏦᎯᏳᏗ, ᎥᏝᏃ ᏴᏫ.

source: The God of our fathers gave Jesus back to life, whom you had put to death, hanging him on a tree.
chr: ᎤᏁᎳᏅᎯ ᏗᎩᏙᏓ ᎤᎾᏤᎵᎦ ᏕᎤᎴᏔᏅ ᏥᏌ, ᎾᏍᎩ ᏤᏥᎸᎩ ᎨᏛ ᏤᏣᏛᏅᎩ.

source: Him God has put on high at his right hand, as a Ruler and a Saviour, to give to Israel a change of heart and forgiveness of sins.
chr: ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏌᎳᏓᏅ ᎠᎦᏘᏏ ᎤᏬᏰᏂ ᎤᏩᏔᏅ, ᎤᎬᏫᏳᎯ ᎠᎴ ᎠᏓᏍᏕᎵᏍᎩ ᎢᏳᎵᏍᏙᏗᏱ, ᎢᏏᎵ ᏧᏁᏗᏱ ᏧᏂᏁᏟᏴᏍᏗᏱ ᏚᎾᏓᏅᏛᎢ, ᎠᎴ ᎦᎨᏥᏁᏗᏱ ᎤᏂᏍᎦᏅᏨᎢ.

source: And we are witnesses of these things, and so is the Holy Spirit, whom God has given to those who keep his laws.
chr: ᎠᏴᏃ ᏧᏤᎵ ᎣᏥᏃᎮᏍᎩ ᎾᏍᎩ ᎯᎠ ᏄᏍᏛᎢ, ᎠᎴ ᎾᏍᏉ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏧᏁᎸᎯ ᏥᎩ ᎬᏬᎯᏳᎲᏍᎩ.

source: But when these words came to their ears, they were cut to the heart, and had a mind to put them to death.
chr: ᎾᏍᎩᏃ ᎤᎾᏛᎦᏅ ᏚᏂᏘᎴ ᏧᏂᎾᏫᏱ, ᎠᎴ ᏧᏂᎯᏍᏗᏱ ᎤᏂᏱᎵᏙᎴᎢ.

source: But one of the Sanhedrin, a Pharisee named Gamaliel, a man of learning in the law, of whom all the people had a high opinion, got up and made a suggestion for the men to be put outside for a little time.
chr: ᎿᏉᏃ ᏕᎦᎳᏫᎥᎢ ᎩᎶ ᎢᏳᏍᏗ ᏚᎴᏁ ᎠᏆᎵᏏ ᎨᎺᎵ ᏧᏙᎢᏛ ᏗᎧᎿᏩᏛᏍᏗ ᏗᎪᏏᏏᏍᎩ ᎾᏂᎥ ᏴᏫ ᎬᏩᎸᏉᏗ, ᎠᎴ ᎤᏁᏤ ᎨᏥᏅᏏᏛ ᏞᎦ ᏧᏂᎧᎲᏍᏗᏱ.

source: And he said to them, Men of Israel, take care what you do about these men.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ; ᎢᏥᏍᎦᏯ ᎢᏏᎵ ᏧᏪᏥ ᎢᏤᏯᏔᎮᏍᏗ ᏄᏍᏛ ᎢᏣᏓᏅᏖᏍᎬ ᎢᏗᏳᏁᏗᏱ ᎯᎠ ᎠᏂᏍᎦᏯ.

source: For before this there was Theudas, who said he was someone important, to whom about four hundred men gave their support: he was put to death, and his band was broken up and came to nothing.
chr: ᎢᎸᎯᏳᏰᏃ ᏧᎾᏄᎪᏤ ᏚᏓᏏ ᎩᎶ ᏧᏤᎸᏎᎢ, ᎠᏂᏍᎦᏯ ᏅᎩᏧᏈ ᎢᏴᏛ ᎢᏯᏂᏛ ᏥᎬᏩᎵᎪᏁᎴᎢ, ᎾᏍᎩ ᏣᏥᎴᎢ, ᎠᎴ ᏂᎦᏛ ᎾᏍᎩ ᎬᏬᎯᏳᏅᎯ ᏧᎾᏗᎦᎴᏲᏤ ᎠᎴ ᏥᏫᎬᏩᏂᏲᏥᏙᎴᏉ.

source: After this man, there was Judas of Galilee, at the time of the numbering, and some of the people went after him: he was put to death, and all his supporters were put to flight.
chr: ᎣᏂᏃ ᏧᎾᏄᎪᏤ ᏧᏓᏏ ᎨᎵᎵ ᎡᎯ ᏣᎾᏎᎵᏙᎮ ᎢᏳᎢ, ᎠᎴ ᎤᏂᏣᏘ ᏴᏫ ᏥᏚᏘᎿᏫᏛᎮᎢ, ᎾᏍᎩᏃ ᎾᏍᏉ ᏥᎤᏲᎱᏎᎢ ᎠᎴ ᏂᎦᏛ ᎾᏂᎥ ᎬᏬᎯᏳᏅᎯ ᏧᎾᏗᎦᎴᏲᏤᎢ.

source: And now I say to you, Do nothing to these men, but let them be: for if this teaching or this work is of men, it will come to nothing:
chr: ᎿᏉᏃ ᎯᎠ ᏂᏨᏪᏎᎭ, ᏞᏍᏗ ᏗᏣᎵᏌᎳᏁᎸ ᎯᎠ ᎠᏂᏍᎦᏯ, ᎤᎾᏁᎳᎩ ᏗᏤᎵᏏ, ᎢᏳᏰᏃ ᎯᎠ ᎠᎾᏓᏅᏖᏍᎬ ᎠᎴ ᏚᏂᎸᏫᏍᏓᏁᎲ ᏴᏫᏉ ᏅᏓᏳᏓᎴᏅᎯ ᎢᎨᏎᏍᏗ, ᎤᏲᏥᏓᏍᏗᏉ;

source: But if it is of God, you will not be able to overcome them, and you are in danger of fighting against God.
chr: ᎤᏁᎳᏅᎯᏍᎩᏂ ᏅᏓᏳᏓᎴᏅᎯ ᎢᎨᏎᏍᏗ, ᎥᏝ ᏰᎵ ᏴᎨᏥᏲᏍᏓ; ᏯᎵᎦᏚᏓᎩᏰᏃ ᎤᏁᎳᏅᎯᏉ ᏤᏣᏟᏴᎡᎯ ᎨᏒᎢ.

source: And he seemed to them to be right: and they sent for the Apostles, and, after having them whipped and giving them orders to give no teaching in the name of Jesus, they let them go.
chr: ᎾᏍᎩᏃ ᎬᏬᎯᏳᏁᎢ; ᏫᏚᏂᏯᏅᎲᏃ ᎨᏥᏅᏏᏛ ᎠᎴ ᏚᏂᎵᎥᏂᎸ, ᏚᏂᏅᏍᏓᏕᎴ ᏥᏌ ᏚᏙᎥ ᎤᏂᏁᎢᏍᏙᏗᏱ, ᎠᎴ ᏚᏂᎧᏁᎢ.

source: So they went away from the Sanhedrin, happy to undergo shame for the Name.
chr: ᎤᏂᏄᎪᏤᏃ ᏕᎦᎳᏫᎥᎢ ᎠᎾᎵᎮᎵᎨ ᏰᎵ ᎤᏕᎰᎯᏍᏗ ᎢᎬᏩᎾᎵᏍᏓᏁᏗ ᎨᏒ ᎾᏍᎩ ᏕᎤᏙᎥ ᏅᏗᎦᎵᏍᏙᏍᎬᎢ.

source: And every day, in the Temple and privately, they went on teaching and preaching Jesus as the Christ.
chr: ᏂᏚᎩᏨᏂᏒᏃ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᎴ ᏓᏓᏁᎳᏗᏒ ᎾᏂᏑᎵᎪᎬᎾ ᎨᏎ ᏓᎾᏕᏲᎲᏍᎨ ᎠᎴ ᎠᎾᎵᏥᏙᎲᏍᎨ ᎣᏍᏛ ᎧᏃᎮᏛ ᏥᏌ ᎦᎶᏁᏛ ᎤᎬᏩᎵ.

source: Now in those days, when the number of the disciples was increasing, protests were made by the Greek Jews against the Hebrews, because their widows were not taken care of in the distribution of food every day.
chr: ᎾᎯᏳᏃ ᎠᏃᎯᏳᎲᏍᎩ ᎤᏂᏣᏔᏅ, ᎠᏂᎪᎢ ᎤᏂᏬᏂᎯᏍᏗ ᎠᏂᏬᏂᏍᎩ ᎪᎱᏍᏗ ᏓᏃᏎᎮ ᎠᏂᏈᎷ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏂᎨᎦᎦᏌᏯᏍᏛᎾ ᎨᏒ ᏧᎾᏤᎵ ᎠᏂᎨᏴ ᏧᏃᏑᎶᏨᎯ ᏂᏚᎩᏨᏂᏒ ᎠᏂᏯᏙᎯᎲᎢ.

source: And the Apostles sent for all the disciples and said, It is not right for us to give up preaching the word of God in order to make distribution of food.
chr: ᎿᏉᏃ ᏔᎳᏚ ᎢᏯᏂᏛ ᎤᏂᏣᏘ ᎠᏃᎯᏳᎲᏍᎩ ᏫᏚᏂᏯᏅᎲ ᎯᎠ ᏄᏂᏪᏎᎢ; ᎥᏝ ᏚᏳᎪᏛ ᏱᎦᎩ ᎢᏳᏃ ᏱᏙᎩᏲᏍᎦ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎧᏃᎮᏛ ᏕᎦᏍᎩᎸᏃ ᏱᏙᎩᎸᏫᏍᏓᏁᎭ.

source: Take then from among you seven men of good name, full of the Spirit and of wisdom, to whom we may give control of this business.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎢᏓᏓᏅᏟ, ᎢᏨᏒ ᎢᏣᏓᏡᎬ ᏗᏣᏑᏯᎩ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᎠᏂᏍᎦᏯ ᎣᏍᏛ ᎨᏥᏃᎮᏍᎩ ᎤᏂᎧᎵᏨᎯ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎠᎴ ᎠᏂᎦᏔᎾᎢ, ᎾᏍᎩ ᎯᎠ ᏧᏂᎸᏫᏍᏓᏁᏗᏱ ᏗᎦᏲᏥᏁᏤᏗ.

source: Then we will give all our time to prayer and the teaching of the word.
chr: ᎠᏴᏍᎩᏂ ᏂᎦᎯᎸ ᎠᏓᏙᎵᏍᏙᏗ ᎨᏒ ᎠᎴ ᎧᏃᎮᏛ ᏙᏓᏲᎩᎸᏫᏍᏓᏁᏗ.

source: And this saying was pleasing to all of them: and they made selection of Stephen, a man full of faith and of the Holy Spirit, and Philip and Prochorus and Nicanor and Timon and Parmenas and Nicolas of Antioch, who had become a Jew:
chr: ᎾᏍᎩᏃ ᏄᏂᏪᏒᎢ ᎣᏏᏳ ᎤᏂᏰᎸᏁ ᏂᎦᏛ ᎤᏂᏣᏘ ᎨᏒᎢ; ᎠᎴ ᎤᎾᏑᏰᏎ ᏍᏗᏫ, ᎠᏍᎦᏯ ᎤᎧᎵᏨᎯ ᎤᏬᎯᏳᏒ ᎠᎴ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎠᎴ ᏈᎵᎩ ᎠᎴ ᏉᎪᎳ ᎠᎴ ᎾᎨᎾ ᎠᎴ ᏔᎹᏂ ᎠᎴ ᏆᎻᎾ ᎠᎴ ᏂᎩ ᎥᏘᎣᎩ ᎡᎯ ᎠᏂᏧᏏ ᏧᎵᎪᏁᎸᎯ;

source: These they took to the Apostles, who, after prayer, put their hands on them.
chr: ᎾᏍᎩᏃ ᎨᏥᏅᏏᏛ ᎠᏂᏅ ᎢᎬᏱᏗᏢ ᏚᏂᎧᏁᎢ; [ᎨᏥᏅᏏᏛᏃ] ᎤᎾᏓᏙᎵᏍᏔᏅ ᏚᎾᏏᏔᏕᎢ.

source: And the word of God was increasing in power; and the number of the disciples in Jerusalem became very great, and a great number of priests were in agreement with the faith.
chr: ᎧᏃᎮᏛᏃ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎧᏁᏉᎨᎢ, ᎾᏂᎥᏃ ᎠᏃᎯᏳᎲᏍᎩ ᎤᏣᏘ ᎠᏂᏁᏉᎨ ᏥᎷᏏᎵᎻ, ᎤᏂᏣᏘᏃ ᎠᏥᎸᎠᏁᎶᎯ ᎤᏃᎯᏳᏁ ᎪᎯᏳᏗ ᎨᏒᎢ.

source: And Stephen, full of grace and power, did great wonders and signs among the people.
chr: ᏍᏗᏫᏃ ᎤᎧᎵᏨᎯ ᎤᏬᎯᏳᏒ ᎠᎴ ᎤᎵᏂᎬᎬ ᎤᏣᏖ ᎤᏍᏆᏂᎪᏗ ᎠᎴ ᎤᏰᎸᏛ ᏚᎸᏫᏍᏓᏁᎮ ᏴᏫ ᎠᏁᎲᎢ.

source: But some of those who were of the Synagogue named that of the Libertines, and some of the men of Cyrene and of Alexandria and those from Cilicia and Asia, had arguments with Stephen.
chr: ᎿᏉᏃ ᏚᎾᎴᏁ ᎩᎶ ᎢᏳᎾᏍᏗ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᏁᎳ ᎠᏂᎵᏆᏗᏂ ᏧᏂᎳᏫᎢᏍᏗᏱ ᏥᏚᏙᎥ, ᎠᎴ ᏌᎵᏂ ᎠᏂᎯ, ᎠᎴ ᎡᎵᏱᎩ ᎠᏁᎯ, ᎠᎴ ᏏᎵᏏᏱ ᎠᏁᎯ, ᎠᎴ ᎡᏗᏱ ᎠᏁᎯ, ᎤᎾᎵᏃᎮᏔᏁ ᏍᏗᏫ.

source: But they were not able to get the better of him, for his words were full of wisdom and of the Spirit.
chr: ᎥᏝᏃ ᏰᎵ ᎬᏩᏂᎭᎷᎩᏍᏗ ᏱᎨᏎ ᎠᏏᎾᏌᏅ ᎠᎴ ᎠᏓᏅᏙ ᏕᎬᏗᏍᎬ ᎦᏬᏂᏍᎬᎢ.

source: Then they got men to say, He has said evil against Moses and against God, in our hearing.
chr: ᎿᏉᏃ ᏚᏂᏅᏎ ᎠᏂᏍᎦᏯ ᎾᏍᎩ ᎯᎠ ᎢᏯᏂᏪᏍᎩ; ᎣᏣᏛᎦᏁᎸ ᎾᏍᎩ ᎧᏁᎬᎢ ᎠᏐᏢᎢᏍᏗᏍᎬ ᎼᏏ ᎠᎴ ᎤᏁᎳᏅᎯ.

source: And the people, with the rulers and the scribes, were moved against him, and they came and took him before the Sanhedrin,
chr: ᏚᏂᏖᎸᏁᏃ ᎤᏂᏣᏘ ᏴᏫ ᎠᎴ ᏗᏂᎳᏫᎩ ᎠᎴ ᏗᏃᏪᎵᏍᎩ, ᎤᏂᏃᎴᏃ ᎠᎴ ᎤᏂᏂᏴᎮ ᎠᎴ ᏕᎦᎳᏫᎥ ᎤᎾᏘᏃᎴᎢ.

source: And they got false witnesses who said, This man is for ever saying things against this holy place and against the law:
chr: ᎦᏰᎪᎩᏃ ᎠᏂᏃᎮᏍᎩ ᏚᏂᎧᏁᎢ, ᎾᏍᎩ ᎯᎠ ᎢᏯᏂᏪᏍᎩ; ᎯᎠ ᎠᏍᎦᏯ Ꮭ ᏯᏑᎵᎪᎦ ᎧᏁᎬ ᎠᏐᏢᎢᏍᏗᏍᎬ ᎯᎠ ᎾᏍᎩ ᎦᎸᏉᏗᏳ ᎨᏒ ᎠᎴ ᏗᎧᎿᏩᏛᏍᏗ.

source: For he has said in our hearing that this Jesus of Nazareth will put this place to destruction and make changes in the rules which were handed down to us by Moses.
chr: ᎣᎦᏛᎦᏅᏰᏃ ᎯᎠ ᏂᎧᏪᏍᎬᎩ; ᎾᏍᎩ ᎯᎠ ᏥᏌ ᎾᏎᎵᏗ ᏤᎲᎩ ᏛᏲᏍᏔᏂ ᎠᏂ, ᎠᎴ ᏓᎦᏁᏟᏴᏏ ᎢᏯᏛᏁᎵᏓᏍᏗ ᎾᏍᎩ ᎼᏏ ᎢᎩᏁᎸᎯ.

source: And all those who were in the Sanhedrin, looking at him, saw that his face was like the face of an angel.
chr: ᏂᎦᏛᏃ ᏕᎦᎳᏫᎥ ᎠᏂᏂ ᎤᏯᏅᏒᎯ ᏓᏂᎧᏅ ᎤᏂᎪᎮ ᎤᎧᏛ ᏗᎧᎿᏩᏗᏙᎯ ᎤᎧᏛ ᎾᏍᎩᏯ ᎨᏎᎢ.

source: Then the high priest said, Are these things true?
chr: ᏄᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎨᎶᎯ ᎯᎠ ᏄᏪᏎᎢ; ᎾᏍᎩᏍᎪ ᎤᏃᎯᏳᎯ ᏄᏍᏗ?

source: And he said, My brothers and fathers, give hearing. The God of glory came to our father Abraham, when he was in Mesopotamia, before he was living in Haran,
chr: [ᏍᏗᏫᏃ] ᎯᎠ ᏄᏪᏎᎢ; ᎢᏥᏍᎦᏯ ᎢᏓᏓᏅᏟ ᎠᎴ ᏗᎩᏙᏓ, ᎢᏣᏛᏓᏍᏓ. ᎤᏁᎳᏅᎯ ᎠᏥᎸᏉᏗ ᎬᏂᎨᏒ ᏄᏛᏁᎴ ᎢᎩᏙᏓ ᎡᏆᎭᎻ ᎾᏍᎩ ᎾᎯᏳ ᎺᏌᏆᏕᎻ ᏤᎮᎢ, ᎠᏏᏉ ᎨᎳᏂ ᎾᏁᎳᏗᏍᎬᎾ ᏥᎨᏎᎢ;

source: And said to him, Go out of your land, and away from your family, and come into the land to which I will be your guide.
chr: ᎯᎠᏃ ᏄᏪᏎᎴᎢ; ᏣᏤᎵᎪᎯ ᎯᏄᎪᎢ ᎠᎴ ᎪᎱᏍᏗ ᏗᏨᎿ, ᎠᎴ ᎾᎿ ᎦᏙᎯ ᎬᏯᏎᎮᏗ ᎨᏒ ᏫᎷᎩ.

source: Then he came out of the land of the Chaldaeans, and went into Haran; and from there, when his father was dead, he was guided by God into this land, where you are living now:
chr: ᎿᏉᏃ ᎤᏓᏅᏎ ᎠᏂᎦᎵᏗ ᎤᎾᏤᎵᎪᎯ, ᎨᎳᏂᏃ ᎤᏁᎳᏕᎢ, ᎾᎿᏃ ᏗᎤᏓᏅᏒ, ᎤᏙᏓ ᎤᏲᎱᏒ, ᎡᏍᎦᏂ ᎤᎷᏤᎴᎢ ᎾᏍᎩ ᎠᏂ ᎪᎯ ᏥᏤᎭ.

source: And God gave him no heritage in it, not even enough to put his foot on: but he gave him an undertaking that he would give it to him and to his children after him, though he had no child at that time.
chr: ᎠᎴ ᎥᏝ ᎦᏓ ᎠᏂ ᏳᏁᎴᎢ ᏂᎤᏟᏍᏕ ᏏᎳᏏᏅᎯᏉ ᎢᎩᏛ, ᎠᏎᏃ ᎤᏚᎢᏍᏓᏁᎴ ᎾᏍᎩ ᎤᏤᎵ ᎢᏳᏩᏁᏗᏱ ᎠᎴ ᎾᏍᎩ ᎤᏁᏢᏔᏅᏛ ᎨᏒ ᎠᏏᏉ ᎤᏪᏥ ᏁᎲᎾ ᎨᏎᎢ.

source: And God said that his seed would be living in a strange land, and that they would make them servants, and be cruel to them for four hundred years.
chr: ᎤᏁᎳᏅᎯᏃ ᎯᎠ ᏄᏪᏎᎢ; “ᏣᏁᏢᏔᏅᏛ ᎠᏁᏙᎯ ᎨᏎᏍᏗ ᎾᎿ ᎤᎾᏤ-ᎵᎪᎯ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎠᎴ ᎾᎿ ᎠᏁᎯ ᏙᏓᎬᏩᏂᎾᏢᏂ ᎠᎴ ᎤᏲ ᏅᏓᎬᏩᏅᏁᎵ ᏅᎩᏧᏈ ᏧᏕᏘᏴᏛ.

source: And I will be the judge, said God, of that nation which made them servants: and after that, they will come out and give me worship in this place.
chr: ᎾᏍᎩᏃ ᏑᎾᏓᎴᎩ ᏴᏫ ᏗᎬᏩᏂᎾᏢᏅᎯ ᏙᏓᎦᏥᏳᎪᏓᏁᎵ, ᎣᏂᏃ ᎤᏂᎾᏄᎪᎢᏍᏗ ᎨᏎᏍᏗ ᎠᎴ ᎠᏂ ᎪᎱᏍᏗ ᎬᏆᏛᏁᏗ ᎨᏎᏍᏗ,” ᎤᏛᏁ ᎤᏁᎳᏅᎯ.

source: And he made with him the agreement of which circumcision was the sign. And so Abraham had a son, Isaac, and gave him circumcision on the eighth day; and Isaac had a son, Jacob, and Jacob was the father of the twelve heads of the families of Israel.
chr: ᏗᎧᎿᏩᏛᏍᏗᏃ ᎤᏁᎴ ᎠᎱᏍᏕᏍᏗ ᎨᏒ ᎤᎬᏩᎵ; ᎡᏆᎭᎻᏃ ᎤᏕᏁᎴ ᎡᏏᎩ, ᎤᎱᏍᏕᏎᎴᏃ ᏧᏁᎵᏁ ᎢᎦ, ᎡᏏᎩᏃ ᏤᎦᏈ, ᏤᎦᏈᏃ ᏔᎳᏚ ᎢᏯᏂᏛ ᏗᎩᎦᏴᎵᎨᎢ.

source: And the brothers, moved with envy against Joseph, gave him to the Egyptians for money: but God was with him,
chr: ᏗᎩᎦᏴᎵᎨᏃ ᎠᏅᏳᏤᎲ ᏅᏗᎤᎵᏍᏙᏔᏁ ᎤᏂᎾᏗᏅᏎ ᏦᏩ ᎢᏥᏈᏱ ᏩᎦᏘᏅᏍᏙᏗᏱ; ᎠᏎᏃ ᎤᏁᎳᏅᎯ ᏚᎧᎿᏩᏗᏙᎮᎢ,

source: And made him free from all his troubles, and gave him wisdom and the approval of Pharaoh, king of Egypt, who made him ruler over Egypt and all his house.
chr: ᎠᎴ ᎤᏭᏓᎴᏍᎨ ᏂᎦᏛ ᎤᏲ ᏄᎵᏍᏓᏁᎵᏕᎬᎢ, ᎠᎴ ᎤᏁᎴ ᎣᏏᏳ ᎠᎦᏓᏅᏖᏗᏱ ᎠᎴ ᎠᎦᏔᎿᎢᏳ ᎨᏒ ᎠᎦᏔᎲ ᏇᎵᏲ ᎤᎬᏫᏳᎯ ᎢᏥᏈᏱ, ᎠᎴ ᏄᎬᏫᏳᏌᏕᎩ ᏄᏩᏁᎴ ᎢᏥᏈᏱ, ᎠᎴ ᏂᎦᏛ ᎦᏁᎸᎢ.

source: Now there was no food to be had in all Egypt and Canaan, and there was great trouble: and our fathers were not able to get food.
chr: ᏂᎬᎾᏛᏃ ᎢᏥᏈᏱ ᎠᎴ ᎨᎾᏂ ᏚᎪᏄᎶᏎᎢ, ᎠᎴ ᎤᏣᏘ ᎠᎩᎵᏯ ᏄᎵᏍᏔᏁᎢ, ᏗᎩᎦᏴᎵᎨᏃ ᎤᎾᏠᎨ ᎤᎾᎵᏍᏓᏴᏗ.

source: But Jacob, hearing that there was grain in Egypt, sent out our fathers the first time.
chr: ᏤᎦᏈᏃ ᎤᏛᎦᏅ ᎤᏣᎴᏍᏗ ᎡᎲ ᎢᏥᏈᏱ, ᏕᎤᏅᏎ ᏗᎩᎦᏴᎵᎨ ᎩᎳ ᎾᎨᏎᎢ.

source: And the second time his brothers had a meeting with Joseph, and Pharaoh had knowledge of Joseph's family.
chr: ᏔᎵᏁᏃ ᏦᏩ ᎠᎾᎵᏅᏟ ᎬᏬᎵᏤᎢ, ᎠᎴ ᏇᎵᏲ ᏕᎤᎦᏙᎥᏎ ᏦᏩ ᎪᎱᏍᏗ ᏧᏩᎿ.

source: Then Joseph sent for Jacob his father and all his family, seventy-five persons.
chr: ᏦᏩᏃ ᎤᏓᏅᏎ ᏭᏯᏅᎮ ᎤᏙᏓ ᏤᎦᏈ ᎠᎴ ᏂᎦᏛ ᎤᏩᏒ ᎪᎱᏍᏗ ᏧᏩᎿ, ᎾᏍᎩ ᎦᎵᏆᏍᎪᎯ ᎯᏍᎩᎦᎵ ᎢᏯᏂᎢ.

source: And Jacob went down to Egypt, and came to his end there, and so did our fathers;
chr: ᏤᎦᏈᏃ ᎢᏥᏈᏱ ᏭᎶᏎᎢ, ᎤᏲᎱᏎᏃ, ᎠᎴ ᎾᏍᏉ ᏗᎩᎦᏴᎵᎨᎢ.

source: And they were taken over to Shechem, and put to rest in the place which Abraham got for a price in silver from the sons of Hamor in Shechem.
chr: ᏌᎩᎻᏃ ᏫᏗᎨᏥᏅᏍᏔᏁᎢ ᎠᎴ ᏕᎨᏥᏂᏌᏁ ᎠᏤᎵᏍᏛ ᎾᏍᎩ ᎡᏆᎭᎻ ᎠᏕᎸ ᏧᎫᏴᏔᏁ ᏥᏚᏩᏎᎴ ᎡᎹ ᏧᏪᏥ, ᎾᏍᎩ ᏌᎩᎻ ᎤᏙᏓ.

source: But when the time was near for putting into effect the undertaking which God had given to Abraham, the people were increasing in Egypt,
chr: ᎠᏚᎢᏍᏛᏃ ᎤᏍᏆᎸᎯᏗᏎᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏎᎵᏔᏅᎯ ᏧᏁᏤᎴ ᎡᏆᎭᎻ, ᎾᏍᎩ ᎤᏂᏁᏉᏤ ᏴᏫ ᎠᎴ ᎤᏂᏣᏔᏅᎯ ᏄᎾᎵᏍᏔᏁ ᎢᏥᏈᏱ.

source: Till another king came to power, who had no knowledge of Joseph.
chr: ᎬᏂ ᏅᏩᏓᎴ ᎤᎬᏫᏳᎯ ᎤᎾᏄᎪᏨ ᎾᏍᎩ ᏄᎦᏔᎲᎾ ᏦᏩ.

source: He, having evil designs against our nation, was cruel to our fathers, and they were forced to put out their young children, so that they might not go on living.
chr: ᎾᏍᎩ ᏓᏏᎾᏌᏅᏤᎮ ᎪᎱᏍᏗ ᏗᎬᎿ, ᎠᎴ ᎤᏲ ᏂᏚᏩᏁᎴ ᏗᎩᎦᏴᎵᎨᎢ, ᎾᏍᎩ ᏗᎨᎦᏓᎢᏅᏗᏱ ᏧᎾᏍᏗ ᏧᏁᏥ, ᏗᎬᏩᎾᏛᎯᏍᏗ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ.

source: At which time Moses came to birth, and he was very beautiful; and he was kept for three months in his father's house:
chr: ᎾᎯᏳ ᎼᏏ ᎤᏕᏁᎢ, ᎠᎴ ᎤᏩᏔᏅᎯ ᎤᏬᏚᎯᏳ ᎨᏎᎢ, ᎠᎴ ᎠᏥᏍᏆᏂᎪᏔᏁ ᎤᏙᏓ ᎦᏁᎸᎢ ᏦᎢ ᎢᏯᏅᏙ.

source: And when he was put out, Pharaoh's daughter took him and kept him as her son.
chr: ᎠᎦᏓᎢᏅᏃ ᏇᎵᏲ ᎤᏪᏥ ᎠᎨᏴ ᎤᏁᏎᎢ, ᎠᎴ ᎤᏍᏆᏂᎪᏔᏁᎢ ᎤᏩᏒ ᎤᏪᏥ ᎤᏰᎸᏁᎢ.

source: And Moses was trained in all the wisdom of Egypt, and was great in his words and works.
chr: ᏱᏏᏃ ᎠᎨᏲᏅᎯ ᎨᏎ ᏂᎦᎥ ᎠᏂᎦᏔᎿᎢᏳ ᎨᏒ ᎢᏥᏈᏱ ᎠᏁᎯ, ᎠᎴ ᎤᎵᏂᎩᏗᏳ ᎨᏎ ᎤᏁᎢᏍᏗᏱ ᎠᎴ ᏧᎸᏫᏍᏓᏁᏗᏱ.

source: But when he was almost forty years old, it came into his heart to go and see his brothers, the children of Israel.
chr: ᏅᎦᏍᎪᎯᏃ ᎢᏳᏕᏘᏴᏛ ᏄᎵᏍᏔᏅ, ᎤᏓᏅᏖᎴ ᏧᏩᏛᎲᏍᏗᏱ ᎠᎾᎵᏅᏟ ᎢᏏᎵ ᏧᏪᏥ.

source: And seeing one of them being attacked, he went to his help and gave the Egyptian a death-blow:
chr: ᎤᎪᎲᏃ ᎠᏏᏴᏫ ᎦᏰᏥᏐᏢᏛᎢ, ᎤᏍᏕᎸᎮᎢ, ᎠᎴ ᎤᏞᏤᎴ ᎤᏲ ᎢᏯᎬᏁᎸᎯ, ᎠᎴ ᎤᎴ ᎢᏥᏈᏱ ᎡᎯ.

source: And he was hoping that his brothers would see that God had sent him to be their saviour; but they did not see.
chr: ᎠᎴ ᎯᎠ ᏁᎵᏍᎨᎢ, ᏛᏃᎵᏥ ᎣᏣᎵᏅᏟ ᎤᏁᎳᏅᎯ ᎠᏴ ᎠᏉᏰᏂ ᏗᎬᏔᏂᏒ ᏙᏗᏍᏕᎸᎯᏒᎢ; ᎠᏎᏃ ᎥᏝ ᏳᏃᎵᏤᎢ.

source: And the day after, he came to them, while they were having a fight, and would have made peace between them, saying, Sirs, you are brothers; why do you do wrong to one another?
chr: ᎤᎩᏨᏛᏃ ᏚᎾᏄᎪᏤᎴ ᎠᎾᎵᎲᎢ, ᎠᎴ ᎦᎪᎯᏍᏓᏁᎮ ᎯᎠ ᏄᏪᏎᎢ; “ᎢᏍᏗᏍᎦᏯ, ᏗᏍᏓᏓᏅᏟᏉ; ᎦᏙᏃ ᎤᏲ ᏂᏙᏍᏓᏓᏛᏁᎭ?”

source: But the man who was doing wrong to his neighbour, pushing him away, said, Who made you a ruler and a judge over us?
chr: ᎠᏎᏃ ᎤᏣᏘᏂ ᎢᏳᏛᏁᎸᎯ ᎾᎥ ᎢᏧᎾᏓᎳ ᏗᎤᏪᏌᏙᏰᏉ, ᎯᎠ ᏄᏪᏎᎢ; ᎦᎪ ᏂᏣᎬᏫᏳᏌᏕᎩ ᎠᎴ ᏗᏍᎩᏳᎪᏓᏁᎯ ᎢᏣᎧᏅ ᏂᎯ?

source: Will you put me to death as you did the Egyptian yesterday?
chr: ᏥᎪ ᎠᏴ ᎾᏍᏉ ᏣᏚᎵ ᏍᎩᎯᏍᏗᏱ ᎾᏍᎩᏯ ᎤᏒᎯ ᏥᎸᎩ ᎢᏥᏈᏱ ᎡᎯ?

source: And at these words, Moses went in flight to the land of Midian, and was living there for a time, and had two sons.
chr: ᎾᏍᎩᏃ ᏄᏪᏒ ᎼᏏ ᎤᎵᏘᏎᎢ, ᎠᎴ ᎻᏗᏂ ᎦᏓ ᎠᎲ ᎡᏙᎯ ᏄᎵᏍᏔᏁᎢ, ᎾᎿᏃ ᎠᏂᏔᎵ ᎠᏂᏍᎦᏯ ᏧᏪᏥ ᎬᏩᏕᏁᎴᎢ.

source: At the end of forty years, an angel came to him in the waste land of Sinai, in the flame of a burning thorn-tree.
chr: ᏅᎦᏍᎪᎯᏃ ᏄᏕᏘᏴᎲ ᏗᎧᎿᏩᏗᏙᎯ ᎤᎬᏫᏳᎯ ᎤᏤᎵᎦ ᎬᏂᎨᏒ ᏄᏛᏁᎴ ᎢᎾᎨ ᏌᎾᏱ ᎣᏓᎸ ᎤᏪᏲᏓᏛ ᎠᏓᏪᎵᎩᏍᎬᎢ.

source: And Moses, seeing it, was full of wonder, and when he came up to have a nearer view of it, the voice of the Lord came to him, saying,
chr: ᎼᏏᏃ ᎤᎪᎲ ᎤᏍᏆᏂᎪᏎ ᏄᏍᏛ ᎠᎪᏩᏘᏍᎬᎢ. ᎤᎪᎵᏰᏗᏱᏃ ᎤᏰᎸᏅ ᎾᎥ ᏭᎷᏨ ᏗᎪᎵᏰᏎᎢ, ᎤᎬᏫᏳᎯ ᎧᏁᎬ ᎤᏛᎦᏁ [ᎯᎠ ᏂᎦᏪᏍᎨᎢ;]

source: I am the God of your fathers, the God of Abraham and of Isaac and of Jacob. And Moses, shaking with fear, kept his eyes from looking at it.
chr: “ᎠᏴ ᎤᏁᎳᏅᎯ ᏗᏣᎦᏴᎵᎨ ᎤᎾᏤᎵᎦ, ᎤᏁᎳᏅᎯ ᎡᏆᎭᎻ ᎤᏤᎵᎦ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎡᏏᎩ ᎤᏤᎵᎦ, ᎠᎴ ᎤᏁᎳᏅᎯ ᏤᎦᏈ ᏅᏤᎵᎦ.” ᎣᏏᏃ ᎤᏪᎿᏪᎢ, ᎠᎴ ᎤᏍᎦᎴ ᎤᎪᎵᏰᏗᏱ.

source: And the Lord said, Take off the shoes from your feet, for the place where you are is holy.
chr: ᎤᎬᏫᏳᎯᏃ ᎯᎠ ᏄᏪᏎᎴᎢ; “ᏔᎳᏑᎳᎩ, ᎾᎿᏰᏃ ᏥᏙᎦ ᎦᎸᏉᏗᏳ ᎦᏙᎯ.

source: Truly, I have seen the sorrows of my people in Egypt, and their cries have come to my ears, and I have come down to make them free: and now, come, I will send you to Egypt.
chr: ᎤᏙᎯᏳᎯᏯ ᎠᎩᎪᎲ ᎤᏲ ᏄᎾᎵᏍᏓᏁᎵᏕᎬ ᏴᏫ ᏗᏆᏤᎵ ᎢᏥᏈᏱ ᏣᏁᎭ, ᎠᎴ ᎠᏆᏛᎦᏅ ᏚᏂᎵᏰᏗᏍᎬᎢ, ᎠᎴ ᎠᏆᏠᎣᏏᎸ ᏕᎫᏓᎴᏏᎸ; Ꭷ ᎿᏉ ᏓᎬᏅᏏ ᎢᏥᏈᏱ.”

source: This Moses, whom they would not have, saying, Who made you a ruler and a judge? him God sent to be a ruler and a saviour, by the hand of the angel whom he saw in the thorn-tree.
chr: ᎾᏍᎩ ᎯᎠ ᎼᏏ ᏧᏂᏲᎢᏎᎴ ᎯᎠ ᏥᏄᏂᏪᏎᎢ, ᎦᎪ ᏂᏣᎬᏫᏳᏌᏕᎩ ᎠᎴ ᏚᎪᏗᏍᎩ ᏣᎧᏅ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏅᏎ ᏄᎬᏫᏳᏌᏕᎩ ᎠᎴ ᎤᏄᏓᎴᏍᎩ ᏄᏩᏁᎴ ᎤᏩᏔᏁ ᏗᎧᎿᏩᏗᏙᎯ ᎬᏂᎨᏒ ᎢᏳᏛᏁᎸᎯ ᎤᏪᏲᏓᏛᎢ.

source: This man took them out, having done wonders and signs in Egypt and in the Red Sea and in the waste land, for forty years.
chr: ᎾᏍᎩ ᏚᏘᎿᏫᏛᎮᎢ ᏂᏚᎸᏫᏍᏓᏁᎶ ᎤᏍᏆᏂᎪᏗ ᎠᎴ ᎤᏰᎸᏛ ᎢᏥᏈᏱ ᎠᎴ ᎠᎹ-ᎩᎦᎨᏍᏛᏱ ᎠᎴ ᎢᎾᎨ ᏅᎦᏍᎪᎯ ᏧᏕᏘᏴᏛ.

source: This is the same Moses, who said to the children of Israel, God will give you a prophet from among your brothers, like me.
chr: ᎯᎠ ᎾᏍᎩ ᎼᏏ ᎾᏍᎩ ᎯᎠ ᏥᏂᏚᏪᏎᎴ ᎢᏏᎵ ᏧᏪᏥ; ᎤᎬᏫᏳᎯ ᎢᏣᏁᎳᏅᎯ ᏓᏥᎾᏄᎪᏫᏎᎵ ᎠᏙᎴᎰᏍᎩ ᎢᏣᎵᏅᏟ ᎨᏒ ᏓᎦᎾᏄᎪᏥ ᎠᏴ ᎾᏍᎩᏯᎢ; ᎾᏍᎩ ᏓᏰᏣᏛᎦᏁᎵ.

source: This is the man who was in the church in the waste land with the angel who was talking to him in Sinai, and with our fathers; and to him were given the living words of God, so that he might give them to you.
chr: ᎯᎠ ᎾᏍᎩ Ꮎ ᏥᎨᎳᏗᏙᎮ ᎤᎾᏓᏡᏩᏕᎬ ᎢᎾᎨᎢ, ᏔᎵ ᏧᏛᏗᏕᎨ ᏗᎧᎿᏩᏗᏙᎯ ᎾᏍᎩ ᏧᏁᏤᎴ ᎣᏓᎸ ᏌᎾᏱ, ᏥᎨᎳᏗᏙᎮ ᎠᏁᏙᎲ ᏗᎩᎦᏴᎵᎨᎢ, ᎾᏍᎩ ᎾᏍᏉ ᏥᏓᏥᏲᎯᏎᎴ ᎠᏛᏂᏗᏍᏙᏗ ᎧᏃᎮᏛ ᎠᏴ ᎢᎩᏁᏗ.

source: By whom our fathers would not be controlled; but they put him on one side, turning back in their hearts to Egypt,
chr: ᎾᏍᎩ ᏗᎩᎦᏴᎵᎨ ᎥᏝ ᏳᎾᏚᎵᏍᎨ ᎤᏃᎯᏳᏗᏱ, ᎢᏴᏛᏉᏍᎩᏂ ᏄᏅᏁᏔᏁᎢ, ᎠᎴ ᏚᎾᏓᏅᏛ ᎢᏥᏈᏱᏉ ᏫᏂᏚᏅᏁᎢ,

source: And saying to Aaron, Make us gods to go before us: as for this Moses, who took us out of the land of Egypt, we have no idea what has become of him.
chr: ᎯᎠ ᏄᏂᏪᏎᎴ ᎡᎳᏂ; ᏗᏍᎩᏲᏢᎾᏏ ᏦᎦᏁᎳᏅᎯ ᏗᎪᎦᏘᏂᏙᎯ, ᎯᎠᏰᏃ ᎼᏏ ᎢᏥᏈᏱ ᏂᏙᏓᏲᎦᏘᏅᏍᏔᏅᎯ ᎥᏝ ᏲᏥᎦᏔᎭ ᏄᎵᏍᏓᏁᎸᎢ.

source: And they made the image of a young ox in those days, and made an offering to it, and had joy in the work of their hands.
chr: ᎾᎯᏳᏃ ᎤᏃᏢᏁ ᏩᎦ ᎠᎩᎾ, ᎾᏍᎩᏃ ᏗᏟᎶᏍᏔᏅᎯ ᎠᏥᎸ-ᎨᎳᏍᏗ ᎤᏂᏲᎮᎴᎢ, ᎠᎴ ᎤᎾᎵᎮᎵᏤᎴ ᎤᏅᏒ ᏧᏃᏰᏂ ᏧᏅᏔᏅᎯ ᎤᏃᏢᏅᎯ.

source: But God was turned from them and let them give worship to the stars of heaven, as it says in the book of the prophets, Did you make offerings to me of sheep and oxen for forty years in the waste land, O house of Israel?
chr: ᎿᏉᏃ ᎤᏁᎳᏅᎯ ᎤᎦᏔᎲᏎᎢ, ᎠᎴ ᎤᎾᏁᎳᎩ ᏫᏓᏂᎸᏉᏓ ᎤᏂᏣᏘ ᎦᎸᎶ ᎠᏁᎯ ᏚᏪᎵᏎᎴᎢ, ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ ᎠᎾᏙᎴᎰᏍᎩ ᏧᏃᏪᎳᏅᎯ; “ᏂᎯ ᎢᏏᎵ ᏏᏓᏁᎸᎯ ᎨᏒᎢ, ᏥᎪ ᏕᏍᎩᏃᎮᎸ ᏗᎸᎯ ᎦᎾᏝᎢ ᎠᎴ ᎠᏥᎸ-ᎨᎳᏍᏗ ᏅᎦᏍᎪᎯ ᏥᎾᏕᏘᏴ ᎢᎾᎨᎢ?

source: And you took up the tent of Moloch and the star of the god Rephan, images which you made to give worship to them: and I will take you away, farther than Babylon.
chr: ᎢᏥᎲᏒᏰᏃ ᎦᎵᏦᏙᏗ ᎼᎳᎩ ᎤᏤᎵᎦ ᎠᎴ ᎤᏁᎳᏅᎯ ᎢᏥᏰᎸᎯ ᎴᎻᏈᏂ ᎤᏤᎵᎦ ᏃᏈᏏ, ᏗᏟᎶᏍᏔᏅᎯ ᎾᏍᎩ ᏗᏦᏢᏅᎯ ᏗᏣᏓᏙᎵᏍᏓᏁᏗ; ᏓᏗᎶᏂᏃ ᎤᏗᏗᏢ ᏫᏙᏓᏨᏯᎧᏂ.”

source: Our fathers had the Tent of witness in the waste land, as God gave orders to Moses to make it after the design which he had seen.
chr: ᏗᎩᎦᏴᎵᎨ ᎢᎾᎨ ᎤᏂᎮ ᎦᎵᏦᏛ ᎠᏙᎴᎰᎯᏍᏙᏗ, ᎾᏍᎩᏯ ᎤᏁᏨᎢ ᎼᏏ ᏧᏁᏤᎴ ᎤᏬᏢᏗᏱ ᏧᏟᎶᏍᏙᏗᏱ ᏄᏍᏛ ᎤᎪᎲᎢ.

source: Which our fathers, in their turn, took with them when, with Joshua, they came into the heritage of the nations whom God was driving out before the face of our fathers, till the time of David,
chr: ᎾᏍᎩ ᎾᏍᏉ ᏗᎩᎦᏴᎵᎨ ᏗᎨᏥᏲᎯᏎᎸᎯ ᎨᏒ ᏦᏑᏩ ᏧᎾᏖᏉᎶᏎ ᏧᏂᏲᎴ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᎾᏤᎵᎪᎯ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏥᏚᎨᎯᏕᎴ ᏗᎩᎦᏴᎵᎨ ᏕᏫ ᏤᎮ ᎢᏯᏍᏗ.

source: Who was pleasing to God; and he had a desire to make a holy tent for the God of Jacob.
chr: ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎣᏏᏳ ᎤᏓᏅᏖᏍᎩ ᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏔᏲᎴ ᎤᏩᏛᏗᏱ ᎤᏁᎳᏗᏍᏗᏱ ᎤᏁᎳᏅᎯ ᏤᎦᏈ ᎤᏤᎵᎦ.

source: But Solomon was the builder of his house.
chr: ᎠᏎᏃ ᏐᎵᎹᏅ ᎤᏁᏍᎨᎴᎢ.

source: But still, the Most High has not his resting-place in houses made with hands, as the prophet says,
chr: ᎥᏝᏍᎩᏂᏃᏅ ᏩᏍᏛ ᎦᎸᎳᏗᏳ ᎡᎯ ᏱᎦᏁᎸ ᏓᏓᏁᎸ ᎩᎶ ᏧᏃᏰᏂ ᏧᏅᏔᏅᎯ ᏧᎾᏁᏍᎨᎲᎯ, ᎾᏍᎩᏯ ᎠᏙᎴᎰᏍᎩ ᎯᎠ ᏥᏂᎦᏪᎠ;

source: Heaven is the seat of my power, and earth is a resting-place for my feet: what sort of house will you make for me, says the Lord, or what is my place of rest?
chr: “ᎦᎸᎳᏗ ᎠᎩᏗᏱ ᎡᎶᎯᏃ ᏗᏆᎳᏏᏗᏱ. ᎦᏙ ᎤᏍᏕᏍᏗ ᎦᎵᏦᏕ ᏓᏍᎩᏯᏁᏍᎨᎵ? ᎠᏗᎭ ᎤᎬᏫᏳᎯ; ᎠᎴ ᎭᏢ ᎠᏆᎵᏙᎯᏍᏙᏗᏱ;

source: Did not my hand make all these things?
chr: ᏝᏍᎪ ᎠᏉᏰᏂ ᎠᏋᏔᏅᎯ ᎠᏉᏢᏅᎯ ᏱᎩ ᎯᎠ ᏂᎦᏛ ᏥᏄᏍᏗᏓᎾ?”

source: You whose hearts are hard and whose ears are shut to me; you are ever working against the Holy Spirit; as your fathers did, so do you.
chr: ᏧᏩᏗᏔᏯ ᏗᏥᎩᎵᎨᏂ, ᎠᎴ ᏂᏕᏥᎤᏍᏕᏎᎸᎾ ᏗᏥᎾᏫ ᎠᎴ ᏕᏥᎵᎷᎬᎢ, ᏂᎪᎯᎸ ᎡᏣᏡᏗᏍᎪ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ; ᏗᏥᎦᏴᎵᎨ ᏄᎾᏛᏁᎸ ᎾᏍᎩᏯ ᏂᎯ ᏂᏣᏛᏁᎰᎢ.

source: Which of the prophets was not cruelly attacked by your fathers? and they put to death those who gave them the news of the coming of the Upright One; whom you have now given up and put to death;
chr: ᎦᏙ ᎤᏍᏗ ᎾᏍᎩ Ꮎ ᎠᎾᏙᎴᎰᏍᎩ ᎨᏒ ᏗᏥᎦᏴᎵᎨ ᎥᏝ ᎤᏲ ᎢᏳᏅᏁᎸᎯ ᏱᎩ? ᎠᎴ ᏕᎤᏂᎸ ᎤᎾᏙᎴᎰᏒᎯ ᎬᏂᎨᏒ ᎢᏳᏅᏁᎸᎯ ᎤᎷᎯᏍᏗᏱ ᎾᏍᎦᏅᎾ ᎾᏍᎩ ᏂᎯ ᎡᏥᎶᏄᎡᎸᎯ ᎠᎴ ᎡᏥᎸᎯ ᏥᏄᎵᏍᏔᏅ;

source: You, to whom the law was given as it was ordered by angels, and who have not kept it.
chr: ᏤᏥᏲᎯᏎᎸᎩ ᏗᎧᎿᏩᏛᏍᏗ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎣᏍᏛ ᏄᏅᎿᏕᎬᎢ ᎠᏎᏃ ᎥᏝ ᎢᏥᏍᏆᏂᎪᏔᏅᎯ ᏱᎩ.

source: Hearing these things, they were cut to the heart and moved with wrath against him.
chr: ᎾᏍᎩᏃ ᎤᎾᏛᎦᏅ ᏚᏂᏘᎴ ᏧᏂᎾᏫᏱ, ᎠᎴ ᏗᏂᏄᏙᎬ ᏕᎬᏩᏄᏓᎨᎴᎢ.

source: But he was full of the Holy Spirit, and looking up to heaven, he saw the glory of God and Jesus at the right hand of God.
chr: ᎠᏎᏃ ᎤᎧᎵᏨᎯ ᎨᏎ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎤᏯᏅᏒᎯ ᎦᎸᎳᏗ ᏫᏚᎧᎿᏁᎢ, ᎠᎴ ᏭᎪᎮ ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ, ᎠᎴ ᏥᏌ ᎦᏙᎨ ᎤᏁᎳᏅᎯ ᎠᎦᏘᏏᏗᏢ;

source: And he said, Now I see heaven open, and the Son of man at the right hand of God.
chr: ᎯᎠᏃ ᏄᏪᏎᎢ; ᎬᏂᏳᏉ ᎦᎸᎳᏗ ᎤᎵᏍᏚᎢᏛ ᏥᎪᏩᏘᎭ, ᎠᎴ ᏴᏫ ᎤᏪᏥ ᎦᏙᎦ ᎤᏁᎳᏅᎯ ᎠᎦᏘᏏᏗᏢ.

source: But with loud cries, and stopping their ears, they made an attack on him all together,
chr: ᎠᏍᏓᏯᏃ ᎤᏁᎷᏅ ᏗᏏᎴᏂ ᏚᏂᏍᏚᏁᎢ, ᎠᎴ ᎤᎴᏃᏅᎯ ᎤᎾᏁᎷᎩᎡᎴᎢ;

source: Driving him out of the town and stoning him: and the witnesses put their clothing at the feet of a young man named Saul.
chr: ᎦᏚᎲᏃ ᎤᏂᏄᎪᏫᏒ ᏅᏯ ᏚᏅᏂᏍᏔᏁᎢ. ᎠᏂᎦᏔᎯᏃ ᏧᎾᏅᏬ ᏚᏂᏅᏁ ᏚᎳᏍᎬ ᎾᎥ ᎠᏫᏅ ᏐᎳ ᏧᏙᎢᏛ.

source: And Stephen, while he was being stoned, made prayer to God, saying, Lord Jesus, take my spirit.
chr: ᏅᏯᏃ ᏚᏅᏂᏍᏔᏁ ᏍᏗᏫ ᎠᏓᏙᎵᏍᏗᏍᎨᎢ, ᎯᎠ ᏂᎦᏪᏍᎨᎢ; ᏣᎬᏫᏳᎯ, ᏥᏌ, ᏔᏓᏂᎸᎩ ᎠᏆᏓᏅᏙᎩ.

source: And going down on his knees, he said in a loud voice, Lord, do not make them responsible for this sin. And when he had said this, he went to his rest.
chr: ᏚᎵᏂᏆᏅᏅᏃ ᎠᏍᏓᏯ ᎤᏪᎷᏁᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᏣᎬᏫᏳᎯ, ᏞᏍᏗ ᎯᎠ ᎤᏂᏍᎦᏅᏨ ᏱᎦᎯᏍᏔᏁᏍᏗ. ᎾᏍᎩᏃ ᏄᏪᏒ ᎤᎸᏁᎢ.

source: And Saul gave approval to his death. Now at that time a violent attack was started against the church in Jerusalem; and all but the Apostles went away into all parts of Judaea and Samaria.
chr: ᏐᎳᏃ ᎣᏏᏳ ᎠᏰᎸᏍᎨ ᎠᏥᎸᎢ. ᎾᎯᏳᏃ ᎤᎶᏘ ᎤᏲ ᏂᎨᎬᎾᏕᎨ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏈᎬ ᏥᎷᏏᎵᎻ; ᎠᎴ ᏂᎦᏛ ᎤᎾᏗᎦᎴᏲᏤ ᏂᎬᎾᏛ ᏧᏗᏱ ᎠᎴ ᏌᎺᎵᏱ, ᎨᏥᏅᏏᏛ ᎤᏅᏒ.

source: And God-fearing men put Stephen's body in its last resting-place, making great weeping over him.
chr: ᎠᏂᏍᎦᏯᏃ ᎤᏁᎳᏅᎯ ᎠᏂᎾᏰᏍᎩ ᎤᏂᎾᏫᏛᎮ ᏍᏗᏫ, ᎠᎴ ᎤᏣᏔᏅᎯ ᎤᏂᏍᎪᏂᎴᎢ.

source: But Saul was burning with hate against the church, going into every house and taking men and women and putting them in prison.
chr: ᏐᎳᏍᎩᏂ ᎤᏣᏘ ᎤᏲ ᏂᏕᎬᏁᎮ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏈᎬᎢ, ᏓᏴᎵᏙᎮ ᏓᏓᏁᎳᏗᏒᎢ, ᏕᎦᎾᏌᏁᏏᏙᎮ ᎠᏂᏍᎦᏯ ᎠᎴ ᎠᏂᎨᏴ, ᎠᎴ ᏗᏓᏍᏚᏗᏱ ᏓᏴᏗᏍᎨᎢ.

source: But those who had gone in flight went everywhere preaching the word.
chr: ᎤᎾᏗᎦᎴᏲᏨᎯᏃ ᎠᏁᏙᎮ ᎠᎾᎵᏥᏙᏂᏙᎮ ᎣᏍᏛ ᎧᏃᎮᏛ.

source: And Philip went down to Samaria and was teaching them about Christ.
chr: ᏈᎵᎩᏃ ᏗᎦᏚᎲ ᏌᎺᎵᏱ ᏭᎶᏎᎢ, ᎠᎴ ᏚᎵᏥᏙᏁᎴ ᏚᏃᎮᎮᎴ ᎦᎶᏁᏛ.

source: And all the people gave attention to the words which Philip said, when they saw the signs which he did.
chr: ᎤᏂᏣᏘᏃ ᏌᏉ ᎢᎦᎦᏛ ᎤᎾᎦᏌᏯᏍᏔᏁ ᏈᎵᎩ ᎧᏃᎮᏍᎬᎢ, ᎤᎾᏛᎦᏅ ᎠᎴ ᎤᏂᎪᎲ ᎤᏍᏆᏂᎪᏗ ᏚᎸᏫᏍᏓᏁᎲᎢ.

source: For unclean spirits came out from those who had them, crying with a loud voice; and a number of those who were ill and broken in body were made well.
chr: ᎠᏂᎦᏓᎭᏰᏃ ᏗᏓᏅᏙ ᎠᏍᏓᏯ ᎠᏁᎷᎲᏍᎨ ᏕᎬᏩᏂᏄᎪᎨ ᎤᏂᏣᏖ ᎬᏩᏂᏯᎢ, ᎠᎴ ᎤᏂᏤᏖ ᏧᏂᎾᏫᏍᎩ ᎠᎴ ᏗᏂᏲᎤᎵ ᏚᎾᏗᏩᏍᎨᎢ.

source: And there was much joy in that town.
chr: ᎤᏣᏔᏅᎯᏃ ᎠᎾᎵᎮᎵᎨ ᎾᎿ ᎦᏚᎲᎢ.

source: But there was a certain man named Simon, who in the past had been a wonder-worker and a cause of surprise to the people of Samaria, saying that he himself was a great man:
chr: ᎩᎶᏍᎩᏂᏃᏅ ᎢᏳᏍᏗ ᎠᏍᎦᏯ ᎾᎿ ᎡᎮ ᏌᏩᏂ ᏧᏙᎢᏛ ᎾᏍᎩ ᎾᎿ ᎦᏚᎲ ᎠᏙᏅᏗ ᏧᎸᏫᏍᏓᏁᎸᎯ ᎨᏎᎢ, ᎠᎴ ᎤᏍᏆᏂᎪᏗ ᏧᏓᏅᏓᏗᏍᏔᏅᎯ ᎨᏎ ᏌᎺᎵᏱ ᎠᏁᎯ, ᎩᎶ ᎢᏳᏍᏗ ᎠᏥᎸᏉᏗ ᎠᏤᎸᏍᎨᎢ.

source: To whom they all gave attention, from the smallest to the greatest, saying, This man is that power of God which is named Great.
chr: ᎾᏍᎩᏃ ᎬᏬᎯᏳᎲᏍᎨ ᎾᏂᎥ ᎨᏥᎸᏉᏗ ᎠᎴ ᎨᏥᎸᏉᏗ ᏂᎨᏒᎾ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ; ᎤᏣᏘ ᎤᎵᏂᎩᏗᏳ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᎯᎠ ᎠᏍᎦᏯ ᎤᏪᎭ.

source: And they gave attention to him, because for a long time his wonder-working powers had kept them under his control.
chr: ᎾᏍᎩᏃ ᎬᏬᎯᏳᎲᏍᎨᎢ, ᎪᎯᏗᏳᏰᏃ ᎬᏩᎴᏅᏛ ᎨᏎ ᎤᏍᏆᏂᎪᏗ ᏓᏓᏅᏓᏗᏍᏗᏍᎨ ᎠᏙᏂᏍᎬᎢ.
